{
  "featured": [
    {
      "quote": "General Principle of Software Quality: Improving quality reduces development costs",
      "author": "Code Complete"
    },
    {
      "quote": "The competent programmer is fully aware of the strictly limited size of his own skull; therefore, he approaches the programming task in full humility",
      "author": "Edsger W. Dijkstra"
    },
    {
      "quote": "Software's primary technical imperative is to manage complexity",
      "author": "Code Complete"
    },
    {
      "quote": "The best is the enemy of the good. Working toward perfection might prevent completion. Complete it first, and then perfect it",
      "author": "Code Complete"
    },
    {
      "quote": "We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil",
      "author": "Donald Knuth"
    },
    {
      "quote": "Don't change the code randomly. That's voodoo programming"
    },
    {
      "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand",
      "author": "Martin Fowler"
    },
    {
      "quote": "Perfect may be the enemy of good, but it can also be the friend of better. Perfection is debilitating when we see it as a target that we failed to reach. It's motivating when we recognize it as an ideal that's worth striving for even though it can't be reached"
    },
    {
      "quote": "Never attribute to malice that which is adequately explained by stupidity"
    },
    {
      "quote": "May you be granted the serenity to accept the things you cannot change, the courage to change the things you can, and the wisdom to know the difference"
    },
    {
      "quote": "If any man is able to convince me and show me that I do not think or act right, I will gladly change; for I seek the truth by which no man was ever injured. But he is injured who abides in his error and ignorance",
      "author": "Marcus Aurelius"
    },
    {
      "quote": "Now, here, you see, it takes all the running you can do, to keep in the same place. If you want to get somewhere else, you must run at least twice as fast as that!",
      "author": "Red Queen"
    },
    {
      "quote": "We are all captives of the picture in our head - our belief that the world we have experienced is the world that really exists",
      "author": "Walter Lippmann"
    },
    {
      "quote": "There is a lot going on, so that you can sit here and pretend that you know enough to stay alive",
      "author": "Jordan Peterson"
    },
    {
      "quote": "We make our fortunes and call them fate",
      "author": "Benjamin Disraeli"
    },
    {
      "quote": "The things you own end up owning you",
      "author": "Tyler Durden, Fight Club"
    }
  ],
  "notFeatured": [
    {
      "quote": "Testing by itself does not improve software quality. Test results are an indicator of quality, but in and of themselves, they don't improve it. Trying to improve software quality by increasing the amount of testing is like trying to lose weight by weighing yourself more often. What you eat before you step onto the scale determines how much you will weigh, and the software development techniques you use determine how many errors testing will find. If you want to lose weight, don't buy a new scale; change your diet. If you want to improve your software, don't test more; develop better.",
      "author": "Code Complete"
    }
  ]
}
